cfd/openfoam/compressible/rhoSimpleFoam/02_Turbulent/0.orig/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

// ************************************************************************** //

#include "include/boundaryConditions"

// ************************************************************************** //

dimensions [ 1 -1 -1 0 0 0 0 ];

// ************************************************************************** //

internalField   uniform 0;

// ************************************************************************** //

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }
    
    freestream
    {
        type            calculated;
        value           uniform 0;
    }

    model
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
