cfd/openfoam/compressible/rhoSimpleFoam/02_Turbulent/0.orig/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

// ************************************************************************** //

#include "include/boundaryConditions"

// ************************************************************************** //

dimensions [ 0 2 -1 0 0 0 0 ];

// ************************************************************************** //

internalField uniform 0;

// ************************************************************************** //

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }
    
    freestream
    {
        type            calculated;
        value           $internalField;
    }

    model
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************** //
