cfd/openfoam/compressible/rhoSimpleFoam/02_Turbulent/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// ************************************************************************** //

application       rhoSimpleFoam;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           500;

deltaT            1;

writeControl      timeStep;

writeInterval     50;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

// ************************************************************************** //

functions
{
    libs            (fieldFunctionObjects);

    Ma
    {
        type            MachNo;
        executeControl  writeTime;
        writeControl    writeTime;
    }
}

// ************************************************************************** //
