cfd/openfoam/compressible/rhoSimpleFoam/02_Turbulent/system/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

// ************************************************************************** //

limitT
{
    type       limitTemperature;
    active     yes;
    min        101;
    max        1000;
    selectionMode all;
}

// ************************************************************************** //
