cfd/openfoam/compressible/rhoSimpleFoam/02_Turbulent/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

// ************************************************************************** //

#include "include/convergenceConditions"
#include "include/relaxationFactors"

// ************************************************************************** //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|k|omega|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }
}

// ************************************************************************** //

SIMPLE
{
    residualControl
    {
        p               $convergenceCondition_p;
        U               $convergenceCondition_U;
        e               $convergenceCondition_e;
        k               $convergenceCondition_k;
        omega           $convergenceCondition_omega;
    }

    nNonOrthogonalCorrectors 0;
    pMinFactor      0.1;
    pMaxFactor      2;
    
    transonic yes;
}

// ************************************************************************** //

relaxationFactors
{
    fields
    {
        p               $relaxationFactors_p;
        rho             $relaxationFactors_rho;
    }
    equations
    {
        U               $relaxationFactors_U;
        e               $relaxationFactors_e;
        k               $relaxationFactors_k;
        omega           $relaxationFactors_omega;
    }
}

// ************************************************************************** //
